{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "(vertigo) Paroymsal  Positional Vertigo",
    "1": "AIDS",
    "2": "Acne",
    "3": "Alcoholic hepatitis",
    "4": "Allergy",
    "5": "Arthritis",
    "6": "Bronchial Asthma",
    "7": "Cervical spondylosis",
    "8": "Chicken pox",
    "9": "Chronic cholestasis",
    "10": "Common Cold",
    "11": "Dengue",
    "12": "Diabetes ",
    "13": "Dimorphic hemmorhoids(piles)",
    "14": "Drug Reaction",
    "15": "Fungal infection",
    "16": "GERD",
    "17": "Gastroenteritis",
    "18": "Heart attack",
    "19": "Hepatitis B",
    "20": "Hepatitis C",
    "21": "Hepatitis D",
    "22": "Hepatitis E",
    "23": "Hypertension ",
    "24": "Hyperthyroidism",
    "25": "Hypoglycemia",
    "26": "Hypothyroidism",
    "27": "Impetigo",
    "28": "Jaundice",
    "29": "Malaria",
    "30": "Migraine",
    "31": "Osteoarthristis",
    "32": "Paralysis (brain hemorrhage)",
    "33": "Peptic ulcer diseae",
    "34": "Pneumonia",
    "35": "Psoriasis",
    "36": "Tuberculosis",
    "37": "Typhoid",
    "38": "Urinary tract infection",
    "39": "Varicose veins",
    "40": "hepatitis A"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "(vertigo) Paroymsal  Positional Vertigo": 0,
    "AIDS": 1,
    "Acne": 2,
    "Alcoholic hepatitis": 3,
    "Allergy": 4,
    "Arthritis": 5,
    "Bronchial Asthma": 6,
    "Cervical spondylosis": 7,
    "Chicken pox": 8,
    "Chronic cholestasis": 9,
    "Common Cold": 10,
    "Dengue": 11,
    "Diabetes ": 12,
    "Dimorphic hemmorhoids(piles)": 13,
    "Drug Reaction": 14,
    "Fungal infection": 15,
    "GERD": 16,
    "Gastroenteritis": 17,
    "Heart attack": 18,
    "Hepatitis B": 19,
    "Hepatitis C": 20,
    "Hepatitis D": 21,
    "Hepatitis E": 22,
    "Hypertension ": 23,
    "Hyperthyroidism": 24,
    "Hypoglycemia": 25,
    "Hypothyroidism": 26,
    "Impetigo": 27,
    "Jaundice": 28,
    "Malaria": 29,
    "Migraine": 30,
    "Osteoarthristis": 31,
    "Paralysis (brain hemorrhage)": 32,
    "Peptic ulcer diseae": 33,
    "Pneumonia": 34,
    "Psoriasis": 35,
    "Tuberculosis": 36,
    "Typhoid": 37,
    "Urinary tract infection": 38,
    "Varicose veins": 39,
    "hepatitis A": 40
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "transformers_version": "4.57.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
